<template>
  <div class="text-textBlack">
    <main-header />

    <main-table :headers="mainTableHeader" :data="mainTableData" />
  </div>
</template>

<script>
import MainHeader from './components/MainHeader.vue';
import MainTable from './components/MainTable.vue';

export default {
  components: { MainHeader, MainTable },

  data() {
    return {
      /** @type {string[]} */
      mainTableHeader: [
        '№',
        'Тип ТС',
        'Номер ТС',
        'ТН/ЖДН',
        'Грузоотправитель',
        'Грузополучатель',
        'Дата отгрузки',
        'Дата приемки',
        'Кол-во мест',
        'Вес',
        'Упаковка',
        'Наименование груза',
        'Укрупненное наименование груза',
        'Порт выгрузки',
        'Приемный акт',
        '№ места',
        'Объект',
        'Договор поставки',
        'Место складирования в порту',
        'Длина',
        'Ширина',
        'Высота',
        'Ф/Е',
        'Класс опасности',
        'Оговорки',
        'Номер контейнера',
        'Диаметр',
        'Толщина стенки',
        '№ трубы',
        '№ сегмента',
        'Статус',
        'Дата расхода',
        '№ расходного ордера',
      ],
      /** @type {Array.<string[]>} */
      mainTableData: [
        [
          '№',
          'Тип ТС',
          'Номер ТС',
          'ТН/ЖДН',
          'Грузоотправитель',
          'Грузополучатель',
          'Дата отгрузки',
          'Дата приемки',
          'Кол-во мест',
          'Вес',
          'Упаковка',
          'Наименование груза',
          'Укрупненное наименование груза',
          'Порт выгрузки',
          'Приемный акт',
          '№ места',
          'Объект',
          'Договор поставки',
          'Место складирования в порту',
          'Длина',
          'Ширина',
          'Высота',
          'Ф/Е',
          'Класс опасности',
          'Оговорки',
          'Номер контейнера',
          'Диаметр',
          'Толщина стенки',
          '№ трубы',
          '№ сегмента',
          'Статус',
          'Дата расхода',
          '№ расходного ордера',
        ],
        [
          '№',
          'Тип ТС',
          'Номер ТС',
          'ТН/ЖДН',
          'Грузоотправитель',
          'Грузополучатель',
          'Дата отгрузки',
          'Дата приемки',
          'Кол-во мест',
          'Вес',
          'Упаковка',
          'Наименование груза',
          'Укрупненное наименование груза',
          'Порт выгрузки',
          'Приемный акт',
          '№ места',
          'Объект',
          'Договор поставки',
          'Место складирования в порту',
          'Длина',
          'Ширина',
          'Высота',
          'Ф/Е',
          'Класс опасности',
          'Оговорки',
          'Номер контейнера',
          'Диаметр',
          'Толщина стенки',
          '№ трубы',
          '№ сегмента',
          'Статус',
          'Дата расхода',
          '№ расходного ордера',
        ],
      ],
    };
  },
};
</script>

<style lang="postcss"></style>
